{
  "2.1.0": {
    "en": "Added more detailed flow events and base support for homey 3.0 power management. "
  },
  "2.1.1": {
    "en": "Update artwork to fit the app better and new app logo"
  },
  "2.2.0": {
    "en": "Improved the new device wizard, allowing to select your charge card per charge point and to select what car you attach to that charge point. Next more logging and error handling on adding devices (if you still have problems please submit the log for review, disclaimer; the chargepoint might reveal a address).It now can show power consumption, but you still have to set a manual value for the cars charge capability on your charger. Fine tuned the flow cards so that you have more detailed triggers to work with. Improved account security so your password does not get stored in the cloud backup of homey if you enable that."
  },
  "2.2.1": {
    "en": "Removed card rfid from logging to ensure privacy"
  },
  "2.2.2": {
    "en": "Improved the new device wizard, allowing to select your charge card per charge point and to select what car you attach to that charge point. Next more logging and error handling on adding devices (if you still have problems please submit the log for review, disclaimer; the chargepoint might reveal a address).It now can show power consumption, but you still have to set a manual value for the cars charge capability on your charger. Fine tuned the flow cards so that you have more detailed triggers to work with. Improved account security so your password does not get stored in the cloud backup of homey if you enable that."
  },
  "2.2.3": {
    "en": "fix to pass submission"
  },
  "2.2.4": {
    "en": "fix in readme"
  },
  "2.2.5": {
    "en": "update homey sdk requirement"
  },
  "2.2.6": {
    "en": "flow card fix"
  },
  "2.2.7": {
    "en": "fix for the readme"
  },
  "3.0.0": {
    "en": "Upgraded the app to be compatible with Homey SDK 3"
  },
  "3.0.1": {
    "en": "Attempt to fix login step in some cases returning an error while correct info is provided"
  },
  "3.1.0": {
    "en": "Added support for multiple cars and cahrgecards using flow cards, also added tokens on triggers for advanced logging"
  },
  "3.1.1": {
    "en": "Thanks to hansallis a quick fix for the recent issue handling the cookie that resulting in problems with the token."
  },
  "3.1.2": {
    "en": "Attempt to fix the app icon properly"
  },
  "3.2.0": {
    "en": "Added support to show the active card in the device screen and active card now is retrieved from the session. This results in support for sessions started using a card swipe for example. Thanks to HansAllis for this code."
  },
  "3.2.1": {
    "en": "Another quick bugfix as a response to changes api behaviour, again thanks to hansallis for the quick fix"
  },
  "3.3.0": {
    "en": "Minor bugfix and change to support new shellrecharge domain"
  }
}
